#Задача1. Попросите пользователя ввести три
#слова. Выведите их в одну строку,
#разделяя символом -, а после третьего
#слова не переходите на новую строку,
#а добавьте точку

#a,b,c = input(),input(),input()
#print(a,b,c,sep = "-", end = ".")


#Задача2. Напишите программу, которая
#спрашивает у пользователя три
#значения: целое число,
#вещественное число и строку.
#Выведите их на экран в одной
#строке через запятую,
#используя print() с параметром sep

#x,y,z = int(input("Введите целое число")),float(input("Введите вещественное число")),str(input("Введите строку"))
#print(x,y,z,sep =",")



#Задача3. Создайте строку «a.b.g.d.l.m.r.t.k.n.m.t.p.w.g.f.k.b.i.e.k.t.h.k.b.a.y.w.j»
#Выведите на экран список из букв этоц строки

#str = "a.b.g.d.l.m.r.t.k.n.m.t.p.w.g.f.k.b.i.e.k.t.h.k.b.a.y.w.j"
#nov = list(str.replace('.', ''))
#print(nov)


#Задача4.
#С помощью оператора
#«\n» и “\t” создайте строку
# “      Hello,
#Future Step
#”

#a =  "\t Hello,\n Future Step"
#print(a)
