#1 задача
# Дан список списков [[2, 4, 6], [8, 10, 12], [14, 16, 18]].
# Проверьте, все ли подсписки содержат только четные числа.
# a = [[2, 4, 6], [8, 10, 12], [14, 16, 18]]
# c = True
# for values in a:
#     for i in values:
#         if i %2!= 0:
#             c = False
# if not c:
#     print("no")
# else:
#     print("yes")

#2 задача.
#keys = ['name', 'age', 'city', 'profession']
#values = ['Иван', 28, 'Москва', 'Программист']
#Создайте словарь из этих списков и выведите его элементы с номерами строк.
# keys = ['name', 'age', 'city', 'profession']
# values = ['Иван', 28, 'Москва', 'Программист']
# dictionary = dict(zip(keys, values))
# print(dictionary)
# for keys, values in enumerate(dictionary):
#     print(keys, values)

#3.Создайте матрицу 4x4, заполненную числами от 1 до 16.


# 4.Дан список списков [[1, 2, 3], [4, 5, 6], [7, 8, 9]].
# Создайте одномерный список, содержащий все элементы из вложенных списков.
# l = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
# f = [ i for sub in l for i in sub ]
# print(f)

#5.names = ['Alice', 'Bob', 'Charlie']
#ages = [25, 30, 35].Создайте словарь, где ключи - имена, значения - возраста.
# names = ['Alice', 'Bob', 'Charlie']
# ages = [25, 30, 35]
# dictionary = dict(zip(names, ages))
# print(dictionary)

# 6.Дан список чисел [1, 2, 21, 37, 4, 42, 42, 5, 59, 6, 6, 7, 82, 94, 9, 10].
# Создайте множество уникальных нечетных чисел из этого списка.

l = [1, 2, 21, 37, 4, 42, 42, 5, 59, 6, 6, 7, 82, 94, 9, 10]
v = [i for i in l if i %2 != 0]
print(v)



