# Задача1. Пользователь вводит строку. Выведите строку в
# обратном порядке.
# a = str(input())
# b = a[::-1]
# print(b)

#Задача2.Пользователь вводит строку. Выведите каждый
#второй символ строки, начиная с первого
#a = str(input())
#print(a[1:len(a):2])

#Задача3. Пользователь вводит строку. Выведите строку,
# состоящую из первых пяти и последних пяти
# символов.
# a = str(input())
# x = a [:5]
# y = a[-5:]
# v = x +y
# print(v)

#Задача4.Напишите программу, которая выводит на экран
# количество символов в ведённой пользователем
# строке на экран
#a = str(input())
#print(len(a))

#Задача5.Пользователь вводит строку. Выведите индекс первого вхождения
#буквы о. Если буквы о нет, выведите сообщение об этом.
#a = str(input())
#print(a.find("о"))


#Задача6.Найдите индекс последнего вхождения буквы "а"
#в строке, введённой пользователем
#b = str(input())
#print(b.rfind("а"))

